{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [126, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [256, 100], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [100], "dtype": "float32"}]}]}